{
  "architectures": ["MiniMaxM3ForCausalLM"],
  "model_type": "minimax_m3",
  "num_hidden_layers": 60,
  "hidden_size": 6144,
  "num_attention_heads": 64,
  "num_key_value_heads": 4,
  "head_dim": 128,
  "rotary_dim": 64,
  "vocab_size": 200064,
  "max_position_embeddings": 1048576,
  "intermediate_size": 3072,
  "moe_intermediate_size": 3072,
  "shared_intermediate_size": 3072,
  "dense_intermediate_size": 12288,
  "num_local_experts": 128,
  "num_experts_per_tok": 4,
  "n_shared_experts": 1,
  "first_k_dense_replace": 3,
  "use_qk_norm": true,
  "tie_word_embeddings": false,
  "sparse_attention_config": {
    "use_sparse_attention": true,
    "sparse_index_dim": 128,
    "sparse_num_index_heads": 4,
    "sparse_topk_blocks": 16,
    "sparse_block_size": 128
  }
}
