{
  "architectures": [
    "MiniMaxM2ForCausalLM"
  ],
  "model_type": "minimax_m2",
  "num_hidden_layers": 62,
  "hidden_size": 3072,
  "num_attention_heads": 48,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "intermediate_size": 1536,
  "vocab_size": 200064,
  "num_experts_per_tok": 8,
  "num_local_experts": 256,
  "max_position_embeddings": 196608,
  "rope_theta": 5000000,
  "rotary_dim": 64,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-06,
  "use_cache": true,
  "tie_word_embeddings": false,
  "use_qk_norm": true,
  "qk_norm_type": "per_layer",
  "use_routing_bias": true,
  "use_mtp": true,
  "mtp_transformer_layers": 1,
  "num_mtp_modules": 3,
  "shared_intermediate_size": 0,
  "scoring_func": "sigmoid",
  "quantization_config": {
    "quant_method": "fp8",
    "fmt": "float8_e4m3fn",
    "activation_scheme": "dynamic",
    "weight_block_size": [128, 128],
    "modules_to_not_convert": ["gate", "e_score_correction_bias", "lm_head"]
  },
  "auto_map": {
    "AutoConfig": "configuration_minimax_m2.MiniMaxM2Config",
    "AutoModelForCausalLM": "modeling_minimax_m2.MiniMaxM2ForCausalLM"
  },
  "transformers_version": "4.46.1"
}
