{
    "architectures": [
        "KimiK25ForConditionalGeneration"
    ],
    "auto_map": {
        "AutoConfig": "configuration_kimi_k25.KimiK25Config",
        "AutoModel": "modeling_kimi_k25.KimiK25ForConditionalGeneration",
        "AutoModelForCausalLM": "modeling_kimi_k25.KimiK25ForConditionalGeneration"
    },
    "bos_token_id": 163584,
    "dtype": "bfloat16",
    "eos_token_id": 163585,
    "ignore_index": -100,
    "media_placeholder_token_id": 163605,
    "model_type": "kimi_k25",
    "pad_token_id": 163839,
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "weights": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "targets": [
                    "Linear"
                ]
            }
        },
        "ignore": [
            "language_model.lm_head",
            "language_model.model.layers.0.self_attn*",
            "language_model.model.layers.1.self_attn*",
            "language_model.model.layers.10.self_attn*",
            "language_model.model.layers.11.self_attn*",
            "language_model.model.layers.12.self_attn*",
            "language_model.model.layers.13.self_attn*",
            "language_model.model.layers.14.self_attn*",
            "language_model.model.layers.15.self_attn*",
            "language_model.model.layers.16.self_attn*",
            "language_model.model.layers.17.self_attn*",
            "language_model.model.layers.18.self_attn*",
            "language_model.model.layers.19.self_attn*",
            "language_model.model.layers.2.self_attn*",
            "language_model.model.layers.20.self_attn*",
            "language_model.model.layers.21.self_attn*",
            "language_model.model.layers.22.self_attn*",
            "language_model.model.layers.23.self_attn*",
            "language_model.model.layers.24.self_attn*",
            "language_model.model.layers.25.self_attn*",
            "language_model.model.layers.26.self_attn*",
            "language_model.model.layers.27.self_attn*",
            "language_model.model.layers.28.self_attn*",
            "language_model.model.layers.29.self_attn*",
            "language_model.model.layers.3.self_attn*",
            "language_model.model.layers.30.self_attn*",
            "language_model.model.layers.31.self_attn*",
            "language_model.model.layers.32.self_attn*",
            "language_model.model.layers.33.self_attn*",
            "language_model.model.layers.34.self_attn*",
            "language_model.model.layers.35.self_attn*",
            "language_model.model.layers.36.self_attn*",
            "language_model.model.layers.37.self_attn*",
            "language_model.model.layers.38.self_attn*",
            "language_model.model.layers.39.self_attn*",
            "language_model.model.layers.4.self_attn*",
            "language_model.model.layers.40.self_attn*",
            "language_model.model.layers.41.self_attn*",
            "language_model.model.layers.42.self_attn*",
            "language_model.model.layers.43.self_attn*",
            "language_model.model.layers.44.self_attn*",
            "language_model.model.layers.45.self_attn*",
            "language_model.model.layers.46.self_attn*",
            "language_model.model.layers.47.self_attn*",
            "language_model.model.layers.48.self_attn*",
            "language_model.model.layers.49.self_attn*",
            "language_model.model.layers.5.self_attn*",
            "language_model.model.layers.50.self_attn*",
            "language_model.model.layers.51.self_attn*",
            "language_model.model.layers.52.self_attn*",
            "language_model.model.layers.53.self_attn*",
            "language_model.model.layers.54.self_attn*",
            "language_model.model.layers.55.self_attn*",
            "language_model.model.layers.56.self_attn*",
            "language_model.model.layers.57.self_attn*",
            "language_model.model.layers.58.self_attn*",
            "language_model.model.layers.59.self_attn*",
            "language_model.model.layers.6.self_attn*",
            "language_model.model.layers.60.self_attn*",
            "language_model.model.layers.7.self_attn*",
            "language_model.model.layers.8.self_attn*",
            "language_model.model.layers.9.self_attn*",
            "mm_projector*",
            "vision_tower*"
        ],
        "quant_algo": "NVFP4",
        "kv_cache_scheme": {
            "dynamic": false,
            "num_bits": 8,
            "type": "float"
        },
        "producer": {
            "name": "modelopt",
            "version": "0.41.0"
        },
        "quant_method": "modelopt"
    },
    "text_config": {
        "_name_or_path": "",
        "add_cross_attention": false,
        "architectures": [
            "DeepseekV3ForCausalLM"
        ],
        "attention_bias": false,
        "attention_dropout": 0.0,
        "auto_map": {
            "AutoConfig": "configuration_deepseek.DeepseekV3Config",
            "AutoModel": "modeling_deepseek.DeepseekV3Model",
            "AutoModelForCausalLM": "modeling_deepseek.DeepseekV3ForCausalLM"
        },
        "aux_loss_alpha": 0.001,
        "bad_words_ids": null,
        "begin_suppress_tokens": null,
        "bos_token_id": 163584,
        "chunk_size_feed_forward": 0,
        "cross_attention_hidden_size": null,
        "decoder_start_token_id": null,
        "diversity_penalty": 0.0,
        "do_sample": false,
        "dtype": "bfloat16",
        "early_stopping": false,
        "encoder_no_repeat_ngram_size": 0,
        "eos_token_id": 163585,
        "ep_size": 1,
        "exponential_decay_length_penalty": null,
        "finetuning_task": null,
        "first_k_dense_replace": 1,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "hidden_act": "silu",
        "hidden_size": 7168,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "initializer_range": 0.02,
        "intermediate_size": 18432,
        "is_decoder": false,
        "is_encoder_decoder": false,
        "kv_lora_rank": 512,
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "length_penalty": 1.0,
        "max_length": 20,
        "max_position_embeddings": 262144,
        "min_length": 0,
        "model_type": "deepseek_v3",
        "moe_intermediate_size": 2048,
        "moe_layer_freq": 1,
        "n_group": 1,
        "n_routed_experts": 384,
        "n_shared_experts": 1,
        "no_repeat_ngram_size": 0,
        "norm_topk_prob": true,
        "num_attention_heads": 64,
        "num_beam_groups": 1,
        "num_beams": 1,
        "num_experts_per_tok": 8,
        "num_hidden_layers": 61,
        "num_key_value_heads": 64,
        "num_nextn_predict_layers": 0,
        "num_return_sequences": 1,
        "output_attentions": false,
        "output_hidden_states": false,
        "output_scores": false,
        "pad_token_id": 163839,
        "prefix": null,
        "pretraining_tp": 1,
        "problem_type": null,
        "pruned_heads": {},
        "q_lora_rank": 1536,
        "qk_nope_head_dim": 128,
        "qk_rope_head_dim": 64,
        "remove_invalid_values": false,
        "repetition_penalty": 1.0,
        "return_dict": true,
        "return_dict_in_generate": false,
        "rms_norm_eps": 1e-05,
        "rope_scaling": {
            "beta_fast": 32.0,
            "beta_slow": 1.0,
            "factor": 64.0,
            "mscale": 1.0,
            "mscale_all_dim": 1.0,
            "original_max_position_embeddings": 4096,
            "type": "yarn"
        },
        "rope_theta": 50000.0,
        "routed_scaling_factor": 2.827,
        "scoring_func": "sigmoid",
        "sep_token_id": null,
        "seq_aux": true,
        "suppress_tokens": null,
        "task_specific_params": null,
        "temperature": 1.0,
        "tf_legacy_loss": false,
        "tie_encoder_decoder": false,
        "tie_word_embeddings": false,
        "tokenizer_class": null,
        "top_k": 50,
        "top_p": 1.0,
        "topk_group": 1,
        "topk_method": "noaux_tc",
        "torchscript": false,
        "typical_p": 1.0,
        "use_bfloat16": false,
        "use_cache": true,
        "v_head_dim": 128,
        "vocab_size": 163840
    },
    "tie_word_embeddings": false,
    "transformers_version": "4.57.1",
    "use_unified_vision_chunk": true,
    "video_placeholder": "<|kimi_k25_video_placeholder|>",
    "vision_config": {
        "init_pos_emb_height": 64,
        "init_pos_emb_time": 4,
        "init_pos_emb_width": 64,
        "merge_kernel_size": [
            2,
            2
        ],
        "merge_type": "sd2_tpool",
        "mm_hidden_size": 1152,
        "mm_projector_type": "patchmerger",
        "model_type": "",
        "patch_size": 14,
        "pos_emb_type": "divided_fixed",
        "projector_hidden_act": "gelu",
        "projector_ln_eps": 1e-05,
        "text_hidden_size": 7168,
        "video_attn_type": "spatial_temporal",
        "vt_hidden_size": 1152,
        "vt_intermediate_size": 4304,
        "vt_num_attention_heads": 16,
        "vt_num_hidden_layers": 27
    }
}