{
    "architectures": [
        "NemotronHForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "auto_map": {
        "AutoConfig": "configuration_nemotron_h.NemotronHConfig",
        "AutoModelForCausalLM": "modeling_nemotron_h.NemotronHForCausalLM"
    },
    "bos_token_id": 1,
    "chunk_size": 128,
    "conv_kernel": 4,
    "dtype": "bfloat16",
    "eos_token_id": 2,
    "expand": 2,
    "head_dim": 128,
    "hidden_dropout": 0.0,
    "hidden_size": 4096,
    "hybrid_override_pattern": "MEMEMEM*EMEMEMEM*EMEMEMEM*EMEMEMEMEM*EMEMEMEMEM*EMEMEMEMEM*EMEMEMEMEM*EMEMEMEM*EMEMEMEME",
    "initializer_range": 0.02,
    "intermediate_size": 2688,
    "layer_norm_epsilon": 1e-05,
    "mamba_head_dim": 64,
    "mamba_hidden_act": "silu",
    "mamba_num_heads": 128,
    "mamba_proj_bias": false,
    "mamba_ssm_cache_dtype": "float32",
    "max_position_embeddings": 262144,
    "mlp_bias": false,
    "mlp_hidden_act": "relu2",
    "model_type": "nemotron_h",
    "moe_intermediate_size": 2688,
    "moe_latent_size": 1024,
    "moe_shared_expert_intermediate_size": 5376,
    "moe_shared_expert_overlap": false,
    "mtp_hybrid_override_pattern": "*E",
    "n_group": 1,
    "n_groups": 8,
    "n_routed_experts": 512,
    "n_shared_experts": 1,
    "norm_eps": 1e-05,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts_per_tok": 22,
    "num_hidden_layers": 88,
    "num_key_value_heads": 2,
    "num_logits_to_keep": 1,
    "num_nextn_predict_layers": 1,
    "pad_token_id": 0,
    "partial_rotary_factor": 1.0,
    "rescale_prenorm_residual": true,
    "residual_in_fp32": false,
    "rope_theta": 10000,
    "routed_scaling_factor": 5.0,
    "sliding_window": null,
    "ssm_state_size": 128,
    "tie_word_embeddings": false,
    "time_step_floor": 0.0001,
    "time_step_limit": [
        0.0,
        Infinity
    ],
    "time_step_max": 0.1,
    "time_step_min": 0.001,
    "topk_group": 1,
    "transformers_version": "4.57.1",
    "use_bias": false,
    "use_cache": true,
    "use_conv_bias": true,
    "use_mamba_kernels": true,
    "vocab_size": 131072
}