{
    "architectures": [
        "MiniMaxM2ForCausalLM"
    ],
    "attention_dropout": 0.0,
    "attn_type_list": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "auto_map": {
        "AutoConfig": "configuration_minimax_m2.MiniMaxM2Config",
        "AutoModelForCausalLM": "modeling_minimax_m2.MiniMaxM2ForCausalLM"
    },
    "bos_token_id": 1,
    "dtype": "bfloat16",
    "eos_token_id": 2,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 3072,
    "initializer_range": 0.02,
    "intermediate_size": 1536,
    "max_position_embeddings": 196608,
    "model_type": "minimax_m2",
    "mtp_transformer_layers": 1,
    "num_attention_heads": 48,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 62,
    "num_key_value_heads": 8,
    "num_local_experts": 256,
    "num_mtp_modules": 3,
    "output_router_logits": false,
    "partial_rotary_factor": 0.5,
    "qk_norm_type": "per_layer",
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "weights": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "targets": [
                    "Linear"
                ]
            }
        },
        "ignore": [
            "lm_head",
            "model.layers.0.block_sparse_moe.gate",
            "model.layers.0.self_attn*",
            "model.layers.1.block_sparse_moe.gate",
            "model.layers.1.self_attn*",
            "model.layers.10.block_sparse_moe.gate",
            "model.layers.10.self_attn*",
            "model.layers.11.block_sparse_moe.gate",
            "model.layers.11.self_attn*",
            "model.layers.12.block_sparse_moe.gate",
            "model.layers.12.self_attn*",
            "model.layers.13.block_sparse_moe.gate",
            "model.layers.13.self_attn*",
            "model.layers.14.block_sparse_moe.gate",
            "model.layers.14.self_attn*",
            "model.layers.15.block_sparse_moe.gate",
            "model.layers.15.self_attn*",
            "model.layers.16.block_sparse_moe.gate",
            "model.layers.16.self_attn*",
            "model.layers.17.block_sparse_moe.gate",
            "model.layers.17.self_attn*",
            "model.layers.18.block_sparse_moe.gate",
            "model.layers.18.self_attn*",
            "model.layers.19.block_sparse_moe.gate",
            "model.layers.19.self_attn*",
            "model.layers.2.block_sparse_moe.gate",
            "model.layers.2.self_attn*",
            "model.layers.20.block_sparse_moe.gate",
            "model.layers.20.self_attn*",
            "model.layers.21.block_sparse_moe.gate",
            "model.layers.21.self_attn*",
            "model.layers.22.block_sparse_moe.gate",
            "model.layers.22.self_attn*",
            "model.layers.23.block_sparse_moe.gate",
            "model.layers.23.self_attn*",
            "model.layers.24.block_sparse_moe.gate",
            "model.layers.24.self_attn*",
            "model.layers.25.block_sparse_moe.gate",
            "model.layers.25.self_attn*",
            "model.layers.26.block_sparse_moe.gate",
            "model.layers.26.self_attn*",
            "model.layers.27.block_sparse_moe.gate",
            "model.layers.27.self_attn*",
            "model.layers.28.block_sparse_moe.gate",
            "model.layers.28.self_attn*",
            "model.layers.29.block_sparse_moe.gate",
            "model.layers.29.self_attn*",
            "model.layers.3.block_sparse_moe.gate",
            "model.layers.3.self_attn*",
            "model.layers.30.block_sparse_moe.gate",
            "model.layers.30.self_attn*",
            "model.layers.31.block_sparse_moe.gate",
            "model.layers.31.self_attn*",
            "model.layers.32.block_sparse_moe.gate",
            "model.layers.32.self_attn*",
            "model.layers.33.block_sparse_moe.gate",
            "model.layers.33.self_attn*",
            "model.layers.34.block_sparse_moe.gate",
            "model.layers.34.self_attn*",
            "model.layers.35.block_sparse_moe.gate",
            "model.layers.35.self_attn*",
            "model.layers.36.block_sparse_moe.gate",
            "model.layers.36.self_attn*",
            "model.layers.37.block_sparse_moe.gate",
            "model.layers.37.self_attn*",
            "model.layers.38.block_sparse_moe.gate",
            "model.layers.38.self_attn*",
            "model.layers.39.block_sparse_moe.gate",
            "model.layers.39.self_attn*",
            "model.layers.4.block_sparse_moe.gate",
            "model.layers.4.self_attn*",
            "model.layers.40.block_sparse_moe.gate",
            "model.layers.40.self_attn*",
            "model.layers.41.block_sparse_moe.gate",
            "model.layers.41.self_attn*",
            "model.layers.42.block_sparse_moe.gate",
            "model.layers.42.self_attn*",
            "model.layers.43.block_sparse_moe.gate",
            "model.layers.43.self_attn*",
            "model.layers.44.block_sparse_moe.gate",
            "model.layers.44.self_attn*",
            "model.layers.45.block_sparse_moe.gate",
            "model.layers.45.self_attn*",
            "model.layers.46.block_sparse_moe.gate",
            "model.layers.46.self_attn*",
            "model.layers.47.block_sparse_moe.gate",
            "model.layers.47.self_attn*",
            "model.layers.48.block_sparse_moe.gate",
            "model.layers.48.self_attn*",
            "model.layers.49.block_sparse_moe.gate",
            "model.layers.49.self_attn*",
            "model.layers.5.block_sparse_moe.gate",
            "model.layers.5.self_attn*",
            "model.layers.50.block_sparse_moe.gate",
            "model.layers.50.self_attn*",
            "model.layers.51.block_sparse_moe.gate",
            "model.layers.51.self_attn*",
            "model.layers.52.block_sparse_moe.gate",
            "model.layers.52.self_attn*",
            "model.layers.53.block_sparse_moe.gate",
            "model.layers.53.self_attn*",
            "model.layers.54.block_sparse_moe.gate",
            "model.layers.54.self_attn*",
            "model.layers.55.block_sparse_moe.gate",
            "model.layers.55.self_attn*",
            "model.layers.56.block_sparse_moe.gate",
            "model.layers.56.self_attn*",
            "model.layers.57.block_sparse_moe.gate",
            "model.layers.57.self_attn*",
            "model.layers.58.block_sparse_moe.gate",
            "model.layers.58.self_attn*",
            "model.layers.59.block_sparse_moe.gate",
            "model.layers.59.self_attn*",
            "model.layers.6.block_sparse_moe.gate",
            "model.layers.6.self_attn*",
            "model.layers.60.block_sparse_moe.gate",
            "model.layers.60.self_attn*",
            "model.layers.61.block_sparse_moe.gate",
            "model.layers.61.self_attn*",
            "model.layers.7.block_sparse_moe.gate",
            "model.layers.7.self_attn*",
            "model.layers.8.block_sparse_moe.gate",
            "model.layers.8.self_attn*",
            "model.layers.9.block_sparse_moe.gate",
            "model.layers.9.self_attn*"
        ],
        "quant_algo": "NVFP4",
        "kv_cache_scheme": {
            "dynamic": false,
            "num_bits": 8,
            "type": "float"
        },
        "producer": {
            "name": "modelopt",
            "version": "0.0.1.dev507+gbb6639d33"
        },
        "quant_method": "modelopt"
    },
    "rms_norm_eps": 1e-06,
    "rope_theta": 5000000,
    "rotary_dim": 64,
    "router_aux_loss_coef": 0.001,
    "router_jitter_noise": 0.0,
    "scoring_func": "sigmoid",
    "shared_intermediate_size": 0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "transformers_version": "4.57.1",
    "use_cache": true,
    "use_mtp": true,
    "use_qk_norm": true,
    "use_routing_bias": true,
    "vocab_size": 200064
}