{
  "architectures": [
    "Qwen3MoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "decoder_sparse_step": 1,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "max_position_embeddings": 40960,
  "max_window_layers": 48,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 768,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 48,
  "num_key_value_heads": 4,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "modules_to_not_convert": [
      "lm_head",
      "model.layers.0.input_layernorm",
      "model.layers.0.mlp.gate",
      "model.layers.0.post_attention_layernorm",
      "model.layers.1.input_layernorm",
      "model.layers.1.mlp.gate",
      "model.layers.1.post_attention_layernorm",
      "model.layers.2.input_layernorm",
      "model.layers.2.mlp.gate",
      "model.layers.2.post_attention_layernorm",
      "model.layers.3.input_layernorm",
      "model.layers.3.mlp.gate",
      "model.layers.3.post_attention_layernorm",
      "model.layers.4.input_layernorm",
      "model.layers.4.mlp.gate",
      "model.layers.4.post_attention_layernorm",
      "model.layers.5.input_layernorm",
      "model.layers.5.mlp.gate",
      "model.layers.5.post_attention_layernorm",
      "model.layers.6.input_layernorm",
      "model.layers.6.mlp.gate",
      "model.layers.6.post_attention_layernorm",
      "model.layers.7.input_layernorm",
      "model.layers.7.mlp.gate",
      "model.layers.7.post_attention_layernorm",
      "model.layers.8.input_layernorm",
      "model.layers.8.mlp.gate",
      "model.layers.8.post_attention_layernorm",
      "model.layers.9.input_layernorm",
      "model.layers.9.mlp.gate",
      "model.layers.9.post_attention_layernorm",
      "model.layers.10.input_layernorm",
      "model.layers.10.mlp.gate",
      "model.layers.10.post_attention_layernorm",
      "model.layers.11.input_layernorm",
      "model.layers.11.mlp.gate",
      "model.layers.11.post_attention_layernorm",
      "model.layers.12.input_layernorm",
      "model.layers.12.mlp.gate",
      "model.layers.12.post_attention_layernorm",
      "model.layers.13.input_layernorm",
      "model.layers.13.mlp.gate",
      "model.layers.13.post_attention_layernorm",
      "model.layers.14.input_layernorm",
      "model.layers.14.mlp.gate",
      "model.layers.14.post_attention_layernorm",
      "model.layers.15.input_layernorm",
      "model.layers.15.mlp.gate",
      "model.layers.15.post_attention_layernorm",
      "model.layers.16.input_layernorm",
      "model.layers.16.mlp.gate",
      "model.layers.16.post_attention_layernorm",
      "model.layers.17.input_layernorm",
      "model.layers.17.mlp.gate",
      "model.layers.17.post_attention_layernorm",
      "model.layers.18.input_layernorm",
      "model.layers.18.mlp.gate",
      "model.layers.18.post_attention_layernorm",
      "model.layers.19.input_layernorm",
      "model.layers.19.mlp.gate",
      "model.layers.19.post_attention_layernorm",
      "model.layers.20.input_layernorm",
      "model.layers.20.mlp.gate",
      "model.layers.20.post_attention_layernorm",
      "model.layers.21.input_layernorm",
      "model.layers.21.mlp.gate",
      "model.layers.21.post_attention_layernorm",
      "model.layers.22.input_layernorm",
      "model.layers.22.mlp.gate",
      "model.layers.22.post_attention_layernorm",
      "model.layers.23.input_layernorm",
      "model.layers.23.mlp.gate",
      "model.layers.23.post_attention_layernorm",
      "model.layers.24.input_layernorm",
      "model.layers.24.mlp.gate",
      "model.layers.24.post_attention_layernorm",
      "model.layers.25.input_layernorm",
      "model.layers.25.mlp.gate",
      "model.layers.25.post_attention_layernorm",
      "model.layers.26.input_layernorm",
      "model.layers.26.mlp.gate",
      "model.layers.26.post_attention_layernorm",
      "model.layers.27.input_layernorm",
      "model.layers.27.mlp.gate",
      "model.layers.27.post_attention_layernorm",
      "model.layers.28.input_layernorm",
      "model.layers.28.mlp.gate",
      "model.layers.28.post_attention_layernorm",
      "model.layers.29.input_layernorm",
      "model.layers.29.mlp.gate",
      "model.layers.29.post_attention_layernorm",
      "model.layers.30.input_layernorm",
      "model.layers.30.mlp.gate",
      "model.layers.30.post_attention_layernorm",
      "model.layers.31.input_layernorm",
      "model.layers.31.mlp.gate",
      "model.layers.31.post_attention_layernorm",
      "model.layers.32.input_layernorm",
      "model.layers.32.mlp.gate",
      "model.layers.32.post_attention_layernorm",
      "model.layers.33.input_layernorm",
      "model.layers.33.mlp.gate",
      "model.layers.33.post_attention_layernorm",
      "model.layers.34.input_layernorm",
      "model.layers.34.mlp.gate",
      "model.layers.34.post_attention_layernorm",
      "model.layers.35.input_layernorm",
      "model.layers.35.mlp.gate",
      "model.layers.35.post_attention_layernorm",
      "model.layers.36.input_layernorm",
      "model.layers.36.mlp.gate",
      "model.layers.36.post_attention_layernorm",
      "model.layers.37.input_layernorm",
      "model.layers.37.mlp.gate",
      "model.layers.37.post_attention_layernorm",
      "model.layers.38.input_layernorm",
      "model.layers.38.mlp.gate",
      "model.layers.38.post_attention_layernorm",
      "model.layers.39.input_layernorm",
      "model.layers.39.mlp.gate",
      "model.layers.39.post_attention_layernorm",
      "model.layers.40.input_layernorm",
      "model.layers.40.mlp.gate",
      "model.layers.40.post_attention_layernorm",
      "model.layers.41.input_layernorm",
      "model.layers.41.mlp.gate",
      "model.layers.41.post_attention_layernorm",
      "model.layers.42.input_layernorm",
      "model.layers.42.mlp.gate",
      "model.layers.42.post_attention_layernorm",
      "model.layers.43.input_layernorm",
      "model.layers.43.mlp.gate",
      "model.layers.43.post_attention_layernorm",
      "model.layers.44.input_layernorm",
      "model.layers.44.mlp.gate",
      "model.layers.44.post_attention_layernorm",
      "model.layers.45.input_layernorm",
      "model.layers.45.mlp.gate",
      "model.layers.45.post_attention_layernorm",
      "model.layers.46.input_layernorm",
      "model.layers.46.mlp.gate",
      "model.layers.46.post_attention_layernorm",
      "model.layers.47.input_layernorm",
      "model.layers.47.mlp.gate",
      "model.layers.47.post_attention_layernorm"
    ],
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ]
  }
}