{
  "architectures": [
    "DeepseekV4ForCausalLM"
  ],
  "hidden_size": 4096,
  "num_hidden_layers": 43,
  "num_attention_heads": 64,
  "num_key_value_heads": 1,
  "head_dim": 512,
  "vocab_size": 129280,
  "max_position_embeddings": 1048576,
  "moe_intermediate_size": 2048,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "num_experts_per_tok": 6,
  "num_nextn_predict_layers": 1,
  "q_lora_rank": 1024,
  "o_lora_rank": 1024,
  "o_groups": 8,
  "qk_rope_head_dim": 64,
  "index_head_dim": 128,
  "index_n_heads": 64,
  "index_topk": 512,
  "sliding_window": 128,
  "num_hash_layers": 3,
  "hc_mult": 4,
  "hc_sinkhorn_iters": 20,
  "hc_eps": 1e-06,
  "compress_rope_theta": 160000,
  "compress_ratios": [
    0,
    0,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    0
  ],
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "scale_fmt": "ue8m0",
    "weight_block_size": [
      128,
      128
    ]
  },
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 16,
    "original_max_position_embeddings": 65536,
    "type": "yarn"
  },
  "topk_method": "noaux_tc",
  "scoring_func": "sqrtsoftplus",
  "torch_dtype": "bfloat16",
  "model_type": "deepseek_ref"
}
