{
  "architectures": [
    "MiMoV2FlashForCausalLM"
  ],
  "model_type": "mimo_v2_flash",
  "num_hidden_layers": 48,
  "hidden_size": 4096,
  "num_attention_heads": 64,
  "num_key_value_heads": 4,
  "head_dim": 192,
  "v_head_dim": 128,
  "intermediate_size": 16384,
  "vocab_size": 152576,
  "max_position_embeddings": 262144,
  "rope_theta": 5000000,
  "swa_rope_theta": 10000,
  "partial_rotary_factor": 0.334,
  "sliding_window": 128,
  "sliding_window_size": 128,
  "attention_chunk_size": 128,
  "swa_num_attention_heads": 64,
  "swa_num_key_value_heads": 8,
  "swa_head_dim": 192,
  "swa_v_head_dim": 128,
  "hybrid_layer_pattern": [
    0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0,
    1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0
  ],
  "moe_layer_freq": [
    0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1
  ],
  "moe_intermediate_size": 2048,
  "n_routed_experts": 256,
  "n_shared_experts": null,
  "num_experts_per_tok": 8,
  "norm_topk_prob": true,
  "scoring_func": "sigmoid",
  "n_group": 1,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "routed_scaling_factor": null,
  "hidden_act": "silu",
  "layernorm_epsilon": 1e-05,
  "attention_dropout": 0.0,
  "attention_bias": false,
  "attention_value_scale": 0.707,
  "add_swa_attention_sink_bias": true,
  "add_full_attention_sink_bias": false,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.40.1",
  "use_cache": true,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [128, 128]
  }
}
